app/controllers/blogs_controller.rb

  def index
    # ↓記事を全件取得
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    blog = Blog.new(blog_params)
    blog.save
---
INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hopeful lessons from the battle to save rainforests"], ["category", "Nature"], ["body", ""], ["created_at", "2020-03-23 08:58:03.671312"], ["updated_at", "2020-03-23 08:58:03.671312"]]

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "編集テスト"], ["category", "Test"], ["body", "編集できるかのテスト"], ["updated_at", "2020-03-23 09:43:57.260170"], ["id", 1]]

  def destroy
    blog = Blog.find(params[:id])
    blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]